functions:
  - id: comment
    filter: "true"
    disabled: null
    conf:
      comment: Map Crowdstrike Alerts data to the Detection Finding (2004) Class
  - id: eval
    filter: "true"
    disabled: null
    conf:
      add:
        - disabled: false
          name: os_object
          value: "{}"
        - disabled: false
          name: os_object.name
          value: device.platform_name
        - disabled: false
          name: os_object.version
          value: device.os_version
        - disabled: false
          name: os_object.type_id
          value: 'device.platform_name.includes("Windows") ? 100 :
            device.platform_name.includes("Linux") ? 200 :
            device.platform_name.includes("mac") ? 300 : 0'
        - disabled: false
          name: os_object.type
          value: "device.platform_name.includes(\"Windows\") ? 'Windows' :
            device.platform_name.includes(\"Linux\") ? 'Linux' :
            device.platform_name.includes(\"mac\") ? 'macOS' : 'Unknown'"
    groupId: c5yBAR
    description: Set OS Device field
  - id: eval
    filter: "true"
    disabled: null
    conf:
      add:
        - disabled: false
          name: resources
          value: "[{hostname:device.hostname, uid: aggregate_id, ip:device.local_ip}]"
        - name: device
          value: "{}"
          disabled: false
        - disabled: false
          name: device.os
          value: os_object
        - name: device.uid
          value: device.device_id
        - name: device.hostname
          value: device.hostname
        - name: device.ip
          value: device.local_ip
        - disabled: false
          name: device.mac
          value: device.mac_address
        - name: device.vendor_name
          value: device.bios_manufacturer
        - name: device.type
          value: device.product_type_desc
        - disabled: false
          name: device.domain
          value: device.machine_domain
    description: Set device Detection field
    groupId: c5yBAR
  - id: eval
    filter: "true"
    disabled: false
    conf:
      add:
        - name: metadata
          value: "{}"
        - name: metadata.product
          value: "{}"
        - name: metadata.product.name
          value: "'Crowdstrike Falcon Insight'"
        - name: metadata.product.vendor_name
          value: "'CrowdStrike'"
        - name: metadata.product.uid
          value: "'crowdstrike_falcon_insight'"
        - name: metadata.product.version
          value: device.agent_version
        - name: metadata.created_time
          value: created_timestamp
        - disabled: false
          name: metadata.updated_time
          value: updated_timestamp
        - name: metadata.version
          value: "'1.4.0-detection_finding-2004'"
    description: Set metadata Detection field
    groupId: c5yBAR
  - id: eval
    filter: "true"
    disabled: false
    conf:
      add:
        - name: finding_info
          value: "{}"
        - name: finding_info.uid
          value: id
        - name: finding_info.title
          value: display_name
        - name: finding_info.analytic
          value: "{}"
        - name: finding_info.analytic.name
          value: "'CrowdStrike Falcon'"
        - name: finding_info.analytic.type_id
          value: "1"
        - name: finding_info.analytic.uid
          value: composite_id
    description: Set finding_info Detection field
    groupId: c5yBAR
  - id: eval
    filter: "true"
    disabled: false
    conf:
      add:
        - name: activity_id
          value: "automated_triage.triage_recommendation === 'close' ? 3 :
            automated_triage.triage_recommendation === 'escalate' ? 2 : 1"
        - disabled: false
          name: activity_name
          value: "automated_triage.triage_recommendation === 'close' ? 'Close' :
            automated_triage.triage_recommendation === 'escalate' ? 'Update' :
            'Create'"
        - name: category_uid
          value: "2"
        - disabled: false
          name: category_name
          value: "'Findings'"
        - name: class_uid
          value: "2004"
        - disabled: false
          name: class_name
          value: "'Detection Finding'"
        - name: confidence_id
          value: "automated_triage.triage_outcome_confidence >= 90 ? 3 :
            automated_triage.triage_outcome_confidence >= 50 ? 2 : 1"
        - disabled: false
          name: confidence
          value: "automated_triage.triage_outcome_confidence >= 90 ? 'High' :
            automated_triage.triage_outcome_confidence >= 50 ? 'Medium' : 'Low'"
        - name: is_alert
          value: "automated_triage.triage_outcome === 'true_positive' ? true : false"
        - name: message
          value: description
        - name: observables
          value: "[{name:filename, type_id:7},{name:cmdline, type_id:13}, {name:user_name,
            type_id:21}, {name:user_principal, type_id:31}]"
        - name: severity_id
          value: "severity_name==='Critical' ? 5 : severity_name==='High' ? 4 :
            severity_name==='Medium' ? 3 : severity_name==='Low' ? 2 :
            severity_name==='Informational' ? 1 : 0"
        - disabled: false
          name: severity
          value: severity_name
        - name: status_id
          value: "automated_triage.automated_triage.triage_outcome === 'false_positive' ?
            3 : automated_triage.triage_recommendation === 'true_positive' ? 2 :
            1"
        - name: status_code
          value: "automated_triage.automated_triage.triage_outcome === 'false_positive' ?
            'Suppressed' : automated_triage.triage_recommendation ===
            'true_positive' ? 'In Progress' : 'New'"
        - name: status_detail
          value: automated_triage.triage_explanation
        - name: time
          value: _time
        - name: timezone_offset
          value: "0"
        - name: type_uid
          value: "2004 * 100 + (automated_triage.triage_recommendation === 'close' ? 3 :
            automated_triage.triage_recommendation === 'escalate' ? 2 : 1)"
        - disabled: false
          name: raw_data
          value: _raw
        - name: unmapped
          value: "[{tactic: tactic, tactic_id: tactic_id, technique: technique}]"
    description: Set remaining OCSF Detection fields
    groupId: c5yBAR
  - id: eval
    filter: "true"
    disabled: false
    conf:
      keep:
        - unmapped.*
        - message
        - category_uid
        - finding_info.*
        - time
        - observables.*
        - timezone_offset
        - is_alert
        - type_uid
        - metadata.*
        - class*
        - activity*
        - severity*
        - confidence*
        - raw_data
        - status_*
        - device*
        - resources*
      remove:
        - "*"
    description: Drop fields non-OCSF fields
streamtags:
  - cpe
groups:
  c5yBAR:
    name: Set OCSF Detection Finding fields
    index: 1
